{
    "sentence": " Addressing the community about changes to our API Dear redditors,For those of you who dont know me, Im Steve aka  I am one of the founders of Reddit, and Ive been CEO since 2015. On Wednesday, I celebrated my 18th cake-day, which is about 17 years and 9 months longer than I thought this project would last. To be with you here today on Redditeven in a heated moment like thisis an honor.I want to talk with you today about whats happening within the community and frustration stemming from changes we are making to access our API. I spoke to a number of moderators on Wednesday and yesterday afternoon and our product and community teams have had further  conversations with mods as well.First, let me share the background on this topic as well as some clarifying details. On 4/18, we  that we would update access to the API, including premium access for third parties who require additional capabilities and higher usage limits. Reddit needs to be a self-sustaining business, and to do that, we can no longer subsidize commercial entities that require large-scale data use. Theres been a lot of confusion over what these changes mean, and I want to highlight what these changes mean for moderators and developers.   Terms of Service    Effective June 19, 2023, our updated , together with our , replaced the existing Data API terms. Free Data API     Effective July 1, 2023, the rate limits to use the Data API free of charge are:       100 queries per minute per OAuth client id if you are using OAuth authentication and 10 queries per minute if you are not using OAuth authentication.       Today, over 90% of apps fall into this category and can continue to access the Data API for free. Premium Enterprise API / Third-party apps    Effective July 1, 2023, the rate for apps that require higher usage limits is $0.24 per 1K API calls (less than $1.00 per user / month for a typical Reddit third-party app).    Some apps such as Apollo, Reddit is Fun, and Sync have decided this pricing doesnt work for their businesses and will close before pricing goes into effect.     For the other apps, we will continue talking. We acknowledge that the timeline we gave was tight; we are happy to engage with folks who want to work with us. Mod Tools    We know many communities rely on tools like RES, ContextMod, Toolbox, etc., and these tools will continue to have free access to the Data API.    Were working together with Pushshift to  for verified moderators. Mod Bots    If youre creating free bots that help moderators and users (e.g. haikubot, setlistbot, etc), please continue to do so. You can contact us  if you have a bot that requires access to the Data API above the free limits.     Developer Platform is a new platform designed to let users and developers expand the Reddit experience by providing powerful features for building moderation tools, creative tools, games, and more. We are currently in a closed beta with hundreds of developers (sign up ). For those of you who have been around a while, it is the spiritual successor to both the API and Custom CSS. Explicit Content     Effective July 5, 2023, we will limit access to mature content via our Data API as part of an ongoing effort to provide guardrails to how explicit content and communities on Reddit are discovered and viewed.     This change will not impact any moderator bots or extensions.In our conversations with moderators and developers, we heard two areas of feedback we plan to address.  Accessibility - We want everyone to be able to use Reddit. As a result, non-commercial, accessibility-focused apps and tools will continue to have free access. Were working with apps like RedReader and Dystopia and a few others to ensure they can continue to access the Data API. Better mobile moderation - We need more efficient moderation tools, especially on mobile. They are coming. Weve improvements to some tools recently and will continue to do so. About 3% of mod actions come from third-party apps, and weve reached out to communities who moderate almost exclusively using these apps to ensure we address their needs.Mods, I appreciate all the time youve spent with us this week, and all the time prior as well. Your feedback is invaluable. We respect when you and your communities take action to highlight the things you need, including, at times, going private. We are all responsible for ensuring Reddit provides an open accessible place for people to find community and belonging. I will be sticking around to answer questions along with other admins. We know answers are tough to find, so we're switching the default sort to Q&A mode. You can view responses from the following admins here:    - SteveP.S. old.reddit.com isnt going anywhere, and explicit content is still allowed on Reddit as long as it abides by our content policy. edit: formatting Reddit Community Values Hi everyone. Over the last sixteen years, Ive watched as you have organized into thousands of communities, created an endless amount of fun and interesting content, supported one another, and galvanized global movements. Bolstering that growth has been sets of  and implicit values that have helped make Reddit what it is today. With the help of many of you, we have codified these into a set of Community Values that will continue to shape Reddit as we grow and evolve, and Im excited to share them with you today.Community ValuesAt Reddit, we have , which guide our internal work culture and help us make day-to-day decisions. And we also have Community Values, which guide how we develop our product, policies, and community relationships. Our Community Values existed long before they were written down and have helped shape both who we are today and who we want to be moving forward. Theres still a lot to do to make Reddit a place where people all over the world are empowered to create and find community. But being an organization thats capable of doing good in the world and in peoples lives isnt something that just happens. Its something we work at every day, and we use these values to guide us. We use them to make routine decisions about, for example, what to build (or not), and we use them for more difficult decisions, such as whether to take action on a subreddit (or not). Our work at Reddit isnt done. And its work worth doing. These values are an extension of our mission to bring community, belonging, and empowerment to everyone in the world. Reddit wouldnt be Reddit without you, our community. We're sharing these values with you today because we want you to have insight into how we think, and we want to have a common understanding of what we believe is important about Reddit. We expect to and welcome hearing from you if we are not living up to these values (and Im sure some of you are ready to do just that!). Its through these conversations that we will be able to collectively build Reddit into the future.Our five Community Values are: Remember the Human, Empower Communities, Keep Reddit Real, Privacy is a Right, and Believe in the Good.  Remember the HumanWe believe Reddit is the most human place on the internet. Its powered by the creativity, passion, and generosity of the people who spend time here and make it their own. We respect redditors and work hard to give them a place where self-expression can thrive and communities can achieve amazing things together.We also remember that there are real people on the other side of the screen who lead full and complex lives. And often, when someone is struggling or in need of support, they come to Reddit to find help and understanding they cant find elsewhere. We take this role seriously and aim to make Reddit a place where people can continue to find communities that accept and appreciate them for who they are.Empower Communities Reddit succeeds when our communities succeed. When we build anything on Reddit, we start with communityevaluating ideas by how well they empower communities. Reddit has evolved by decentralizing control and empowering communities to create the spaces that work for themspaces that have become some of the most selfless, ingenuitive, funny, and enriching communities on the internet. We trust communities to know what works best for them and give them the autonomy to make decisions for themselves. Keep Reddit RealReddit is where people can be genuine. The humans of Reddit are a vast and diverse group of people, who come to the platform as their full, imperfect, human selves. Sometimes this results in the type of candid, honest discussions you cant have anywhere else; other times it results in the type of communities you find on r/wowthissubexists. We present an authentic, unmanicured version of the world, and as long as being your unfiltered self isnt hurting anyone or violating the , then theres a place for you on Reddit. We dont understand or agree with everything on Reddit (were a vast and diverse group of people, too), and we dont try to conform Reddit to what we or other people think it should be. We do, though, try to create a space that is as real, complex, and wonderful as the world itself.Privacy is a RightReddit stands for privacy. Redditors have complete control of their identity and are empowered to share as much or as little personal information as they want. Redditors dont reveal information about each other without permission, and Reddit Inc. doesnt use nonpublic information about redditors without their consent. To use Reddit, youll never have to surrender your privacy or pay us with your data or information. We also  and  how we use their data. We run ads, and use what people agree to share with us to show them ads we think they might be interested in (and yes, to make money) but we dont and wont ever sell redditors information.  Believe in the GoodReddit reflects humanity. When people on Reddit come together around something they really care about, they can and will do extraordinary things. In our interactions, we try to give each other the benefit of the doubt and remember that most peopleeven when upset, frustrated, or misguidedare decent and reasonable, and will do the right thing given the right circumstances. Believing in the good does not mean disbelieving the bad. There will always be redditors (and people everywhere) who are nasty or just outright horrible at times. But if that was how all redditors were, the platform and its culture wouldnt be what it is today. The overwhelming majority of people come to Reddit because they genuinely want to contribute and feel a sense of belonging. If that's not happening, something is wrong and well fix it. People are good, and if we empower them, the good will always outshine the bad. ---Thank you for reading our Community Values. These mean a lot to me and our team, and Im happy to answer questions you have about them. A group of familiar admins will be responding in the comment section below, and we will also spotlight some questions during a Reddit Talk in a bit that Im holding alongside our VP of Community,  To participate in the Reddit Talk youll need to visit this subreddit (r/reddit) at 11am PT / 2pm ET and tune in to the talk on either web or through the official Reddit app. If you are unable to join the talk while its live, you will be able to listen to a recording of it afterwards. Thank you, Debate, dissent, and protest on Reddit Hey everyoneThe pandemic has been extremely hard on many of us. We believe the best way forward for everyone is to  and continue to follow . Throughout the pandemic, we have also provided COVID-related resources to support our volunteer moderators, users, and communities, including a dedicated AMA series connecting users with  and , as well as deploying homepage and search page banners directing users to the CDC and r/Coronavirus.We appreciate that not everyone agrees with the current approach to getting us all through the pandemic, and some are still wary of vaccinations. Dissent is a part of Reddit and the foundation of democracy. Reddit is a place for open and authentic discussion and debate. This includes conversations that question or disagree with popular consensus. This includes conversations that criticize those that disagree with the majority opinion. This includes protests that criticize or object to our decisions on which communities to ban from the platform.While we appreciate the sentiment of those demanding that we ban more communities that challenge consensus views on the pandemic, we continue to believe in the good of our communities and hope that we collectively approach the challenges of the pandemic with empathy, compassion, and a willingness to understand what others are going through, even when their viewpoint on the pandemic is different from yours. When it comes to COVID-19 specifically, what we know and what are the current best practices from authoritative sources, like the CDC, evolve continuously with new learnings. Given the rapid state of change, we believe it is best to enable communities to engage in debate and dissent, and for us to link to the CDC wherever appropriate. While we believe the CDC is the best and most up to date source of information regarding COVID-19, disagreeing with them is not against our policies.However, manipulating or cheating Reddit to amplify any particular viewpoint is against our policies, and we will continue to action communities that do so or that violate any of our other rules, including those dedicated to fraud (e.g. fake vaccine cards) or encouraging harm (e.g. consuming bleach); and we will continue to use our quarantine tool to link to authoritative sources and warn people they may encounter unsound advice. We humbly ask and encourage everyone to report content that may violate our policies.We are using our  to facilitate discussion of this post within the context of your own communities. An update on the recent issues surrounding a Reddit employee We would like to give you all an update on the recent issues that have transpired concerning a specific Reddit employee, as well as provide you with context into actions that we took to prevent doxxing and harassment.As of today, the employee in question is no longer employed by Reddit. We built a relationship with her first as a mod and then through her contractor work on RPAN. We did not adequately vet her background before formally hiring her. Weve put significant effort into improving how we handle doxxing and harassment, and this employee was the subject of both. In this case, we over-indexed on protection, which had serious consequences in terms of enforcement actions.  On March 9th, we added extra protections for this employee, including actioning content that mentioned the employees name or shared personal information on third-party sites, which we reserve for serious cases of harassment and doxxing. On March 22nd, a news article about this employee was posted by a mod of r/ukpolitics. The article was removed and the submitter banned by the aforementioned rules. When contacted by the moderators of r/ukpolitics, we reviewed the actions, and reversed the ban on the moderator, and we informed the r/ukpolitics moderation team that we had restored the mod. We updated our rules to flag potential harassment for human review.Debate and criticism have always been and always will be central to conversation on Redditincluding discussion about public figures and Reddit itselfas long as they are not used as vehicles for harassment. Mentioning a public figures name should not get you banned.We care deeply for Reddit and appreciate that you do too. We understand the anger and confusion about these issues and their bigger implications. The employee is no longer with Reddit, and well be evolving a number of relevant internal policies.We did not operate to our own standards here. We will do our best to do better for you. Today were testing a new way to discuss political ads (and announcements)  Today were testing a new way to discuss political ads (and announcements) In case you missed  , , and , were doing our best to encourage people on and off Reddit to vote this year. Along with our  and  to guard against shenanigans, weve also been evolving how we handle another important aspect of the election process: political ads.## First, some backgroundPolitical ads have been a relatively quiet part of Reddit for many years. Last year, in thinking through what the right balance was between unfettered political ads and prohibiting them altogether for 2020 (both approaches that other platforms have taken), we decided on : no misinformation, human review of the ads and where they link, a subreddit listing all political ads (), and a requirement to keep comments on for 24 hours.Since debuting this policy earlier this year, the last condition (requiring comments to remain on) has enabled redditors to discuss political adsproviding more context in the comments and even offering counterargumentsbut so far its only been lightly used. As we get closer to November, however, the prominence of and discussion around political ads will increase, and, with it, the need for a clear moderation system for these comments.## The problem were addressingAs I mentioned , unmoderated spaces on Reddit are an area we want to improve, from Modmail to PMs, and political ads pose a unique challenge.If the OP of a political ad (i.e., a campaign) moderates the comments, its problematic: they might remove dissenting perspectives. And if we (the admins) moderate the comments of a political ad, its even more problematic, putting us in the position of either moderating too much or too little, with inevitable accusations of bias either way.The problem, we realized, is similar to what we see in r/announcements: lots of people commenting on a highly visible post outside the context of a community. Its fair to say that r/announcements isnt really a community; it lacks the culture, cohesion, and moderation that benefit most other subreddits, and as a result, the quality of conversation has deteriorated as the audience has grown.Ultimately, conversations really only happen in the context of a community, and neither r/announcements nor political ads with comments on provide this. We believe we can foster better discussion on both with a different approach.## What were testing todayInstead of having the usual free-for-all of comments on the r/announcements post itself, we are trying out a new experience today that encourages discussion of this post within other communitiesan approach we hope works for political ads as well.Below is a stickied comment with a link to submit this post to other communities on Reddit and a list of those discussion posts. The stickied comment will update automatically with new posts.A few other details to note for this test: The discussion posts are like any other post, which means they can be voted on by users and removed by mods. Communities that dont want to participate dont have to. (If youre a mod of a community where a user attempts to crosspost this, you will get a Modmail alerting you to this with .) Individual community rules apply to these posts just as any other, so read the rules before attempting to bring the discussion into a completely unrelated community. Our stickied comment will link to discussions only from communities subject to our ads allow list. Communities that have already opted not to appear in r/all wont appear in the comment either, even if there is a discussion of this post there. After todays test, we will likely test this system with political ads.This test will be a success if there are a variety of posts and conversations about this post, evenand perhaps particularlyif they are critical.## How were answering questionsr/announcements posts have an important difference from political ads: I treat them as AMAs and do my best to answer questions and respond to criticism (both of which I appreciate). With this approach, I expect doing so will be more difficult (at least this first time). However, the point of this test is not to make you hunt for our answers or for us to reply to fewer questions, and we dont intend to use this approach for all our admin posts (e.g., in r/ModNews, r/changelog, r/ModSupport, and others, which are smaller subreddits that still work well).For today, were going to make the first link of this post to r/ModNews and start by answering mods questions there. In a future announcement, we may ask a specific community if they would host us for the discussion that day (depending on what the announcement is) and set that as an official destination for discussion, like a regular AMA.Additionally, Ill do my best to find other places to respond, and well maintain another comment below this post to list replies weve given outside of r/announcements so you can easily find our responses (which was a feature request from  last week).Ultimately, the goal of this test is to enable Reddit to do what Reddit does best: facilitate conversations (within the context of a community), provide commentary on political ads the way redditors already do on news and politics daily (sharing more information and calling bullshit in the comments when necessary), and extend the discussion well beyond the scope of the original post.Thank you for participating. We hope this approach sets the stage for successful commentary not just today but down the road on political ads as well.Steve&#x200B;Edit (9/28/20): Update: After initial testing and a few small tweaks to the sorting and score display of the links in stickied comments like the one below, well be using this discussion system on political ads moving forward. As I mentioned, our goal with this approach was to encourage these types of discussions to happen within the context of a community. While this feature is completely optional for communities (opt-out instructions ), we were pleased overall with the level of engagement that we saw from communities and users on this test post.Were still exploring how well use this feature for r/announcements posts and how we can work with specific communities to have discussions about them. In the meantime, you can see our updated political ads policy on our . Update to Our Content Policy , we committed to closing the gap between our values and our policies to explicitly address hate. After talking extensively with mods, outside organizations, and our own teams, were updating our content policy today and enforcing it (with your help).## First, a quick recapSince our last post, heres what weve been doing: We brought on a . We held policy calls with modsboth from established Mod Councils and from communities disproportionately targeted with hateand discussed areas where we can do better to action bad actors, clarify our policies, make mods' lives easier, and concretely reduce hate.    You can find , including specific product work we discussed. We developed our enforcement plan, including both our immediate actions (e.g., todays bans) and long-term investments (tackling the most critical work discussed in our mod calls, sustainably enforcing the new policies, and advancing Reddits community governance).From our conversations with mods and outside experts, its clear that while weve gotten better in some areaslike actioning violations at the community level, , measurably reducing hateful experiences like harassment we still have a long way to go to address the gaps in our policies and enforcement to date.These include addressing questions our policies have left unanswered (like whether hate speech is allowed or even protected on Reddit), aspects of our product and mod tools that are still too easy for individual bad actors to abuse (inboxes, chats, modmail), and areas where we can do better to partner with our mods and communities who want to combat the same hateful conduct we do.Ultimately, its our responsibility to support our communities by taking stronger action against those who try to weaponize parts of Reddit against other people. In the near term, this support will translate into some of the product work we discussed with mods. But it starts with dealing squarely with the hate we can mitigate today through our policies and enforcement.## New PolicyThis is the . Heres whats different: It starts with a statement of our vision for Reddit and our communities, including the basic expectations we have for all communities and users. Rule 1 explicitly states that communities and users that promote hate based on identity or vulnerability will be banned.    There is an expanded definition of what constitutes a violation of this rule, along with specific examples, in our . Rule 2 ties together our previous rules on prohibited behavior with an ask to abide by community rules and post with authentic, personal interest.    Debate and creativity are welcome, but spam and malicious attempts to interfere with other communities are not. The other rules are the same in spirit but have been rewritten for clarity and inclusiveness.Alongside the change to the content policy, we are initially banning about 2000 subreddits, the vast majority of which are inactive. Of these communities, about  have more than 10 daily users. Both r/The_Donald and r/ChapoTrapHouse were included.All communities on Reddit must abide by our content policy in good faith. We banned r/The_Donald because it has not done so, despite every opportunity. The community has consistently hosted and upvoted more rule-breaking content than average (Rule 1), antagonized us and other communities (Rules 2 and 8), and its mods have refused to meet our most basic expectations. Until now, weve worked in good faith to help them preserve the community as a space for its usersthrough warnings, mod changes, quarantining, and more.Though smaller, r/ChapoTrapHouse was banned for similar reasons: They consistently host rule-breaking content and their mods have demonstrated no intention of reining in their community.To be clear, views across the political spectrum are allowed on Redditbut all communities must work within our policies and do so in good faith, without exception.## Our commitmentOur policies will never be perfect, with new edge cases that inevitably lead us to evolve them in the future. And as users, you will always have more context, community vernacular, and cultural values to inform the standards set within your communities than we as site admins or any AI ever could.But just as our content moderation cannot scale effectively without your support, you need more support from us as well, and we admit we have fallen short towards this end. We are committed to working with you to combat the bad actors, abusive behaviors, and toxic communities that undermine our mission and get in the way of the creativity, discussions, and communities that bring us all to Reddit in the first place. We hope that our progress towards this commitment, with todays update and those to come, makes Reddit a place you enjoy and are proud to be a part of for many years to come.Edit: After digesting feedback, we made a clarifying change to our help center article for . Upcoming changes to our content policy, our board, and where were going from here TL;DR: Were working with mods to change our content policy to explicitly address hate.  has resigned from our board to fill his seat with a Black candidate, a request we will honor. I want to take responsibility for the history of our policies over the years that got us here, and we still have work to do.After watching people across the country mourn and demand an end to centuries of murder and violent discrimination against Black people, I wanted to speak out. I wanted to do this both as a human being, who sees this grief and pain and knows I have been spared from it myself because of the color of my skin, and as someone who literally has a platform and, with it, a duty to speak out.Earlier this week, I wrote an email to our company addressing this crisis and a few ways Reddit will respond. When we shared it, many of the responses said something like, How can a company that has faced racism from users on its own platform over the years credibly take such a position?These questions, which I know are coming from a place of real pain and which I take to heart, are really a statement: There is an unacceptable gap between our beliefs as people and a company, and what you see in our content policy. Over the last fifteen years, hundreds of millions of people have come to Reddit for things that I believe are fundamentally good: user-driven communitiesacross a wider spectrum of interests and passions than I couldve imagined when we first created subredditsand the kinds of content and conversations that keep people coming back day after day. It's why we come to Reddit as users, as mods, and as employees who want to bring this sort of community and belonging to the world and make it better daily.However, as Reddit has grown, alongside much good, it is facing its own challenges around hate and racism. We have to acknowledge and accept responsibility for the role we have played. Here are three problems we are most focused on: Parts of Reddit reflect an unflattering but real resemblance to the world in the hate that Black users and communities see daily, despite the progress we have made in improving our tooling and enforcement.  Users and moderators genuinely do not have enough clarity as to where we as administrators stand on racism.  Our moderators are frustrated and need a real seat at the table to help shape the policies that they help us enforce.We are already working to fix these problems, and this is a promise for more urgency. Our current  is effectively nine rules for what you cannot do on Reddit. In many respects, its served us well. Under it, we have made meaningful progress cleaning up the platform (and done so without undermining the free expression and authenticity that fuels Reddit). That said, we still have work to do. This current policy lists only what you cannot do, articulates none of the values behind the rules, and does not explicitly take a stance on hate or racism.We will update our content policy to include a vision for Reddit and its communities to aspire to, a statement on hate, the context for the rules, and a principle that Reddit isnt to be used as a weapon. We have details to work through, and while we will move quickly, I do want to be thoughtful and also gather feedback from our moderators (through our Mod Councils). With more moderator engagement, the timeline is weeks, not months.And just this morning, Alexis Ohanian ( my Reddit cofounder, announced that he is resigning from our board and that he wishes for his seat to be filled with a Black candidate, a request that the board and I will honor. We thank Alexis for this meaningful gesture and all that hes done for us over the years.At the risk of making this unreadably long, I'd like to take this moment to share how we got here in the first place, where we have made progress, and where, despite our best intentions, we have fallen short.In the early days of Reddit, 20052006, our idealistic policy was that, excluding spam, we would not remove content. We were small and did not face many hard decisions. When this ideal was tested, we  anyway. In the end, we acted based on our beliefs, despite our policy. I left Reddit from 20102015. During this time, in addition to rapid user growth, Reddits no-removal policy  and its content policy took . When I returned in 2015, my top priority was creating a content policy to do two things: deal with hateful communities I had been immediately confronted with (like r/CoonTown, which was explicitly designed to spread racist hate) and provide a clear policy of whats acceptable on Reddit and whats not.  because they were making Reddit worse but were not clear and direct about their role in sowing hate. We crafted our  around behaviors adjacent to hate that were actionable and objective: violence and harassment, because we struggled to create a definition of hate and racism that we could defend and enforce at our scale. Through continual updates to these policies , , ,  (and a broader definition of violence), we have removed thousands of hateful communities. While we dealt with many communities themselves, we still did not provide the clarityand it showed, both in our enforcement and in confusion about where we stand. In 2018, I confusingly said . This gap between our content policy and our values has eroded our effectiveness in combating hate and racism on Reddit; I accept full responsibility for this.This inconsistency has hurt our trust with our users and moderators and has made us slow to respond to problems. This was also true with r/the_donald, a community that relished in exploiting and detracting from the best of Reddit and that is now nearly disintegrated on their own accord. As we looked to our policies, Breaking Reddit was not a sufficient explanation for actioning a political subreddit, and I fear we let being technically correct get in the way of doing the right thing. Clearly, we should have quarantined it sooner.The majority of our top communities have a rule banning hate and racism, which makes us proud, and is evidence why a . That said, this is not a rule communities should have to write for themselves and we need to rebalance the burden of enforcement. I also accept responsibility for this. Despite making significant progress over the years, we have to turn a mirror on ourselves and be willing to do the hard work of making sure we are living up to our values in our product and policies. This is a significant moment. We have a choice: return to the status quo or use this opportunity for change. We at Reddit are opting for the latter, and we will do our very best to be a part of the progress.I will be sticking around for a while to answer questions as usual, but I also know that our policies and actions will speak louder than our comments.Thanks,Steve Spring forward into Reddits 2019 transparency report TL;DR: Today we published our 2019 . Ill stick around to answer your questions about the report (and other topics) in the comments.Hi all,Its that time of year again when we share Reddits annual transparency report.We share this report each year because you have a right to know how user data is being managed by Reddit, and how its both shared and not shared with government and non-government parties.Youll find information on content removed from Reddit and requests for user information. This year, weve expanded the report to include new dataspecifically, a breakdown of content policy removals, content manipulation removals, subreddit removals, and subreddit quarantines.## By the numbersSince the  is rather long, Ill call out a few stats below:ADMIN REMOVALS In 2019, we removed ~53M pieces of content in total, mostly for spam and content manipulation (e.g. brigading and vote cheating), exclusive of legal/copyright removals, which we track separately. For  violations, we removed    222k pieces of content,    55.9k accounts, and    21.9k subreddits (87% of which were removed for being unmoderated). Additionally, we quarantined 256 subreddits.LEGAL REMOVALS Reddit received 110 requests from government entities to remove content, of which we complied with 37.3%. In 2019 we removed about 5x more content for copyright infringement than in 2018, largely due to copyright notices for adult-entertainment and notices targeting pieces of content that had already been removed.REQUESTS FOR USER INFORMATION We received a total of 772 requests for user account information from law enforcement and government entities.    366 of these were emergency disclosure requests, mostly from US law enforcement (68% of which we complied with).    406 were non-emergency requests (73% of which we complied with); most were US subpoenas.    Reddit received an additional 224 requests to temporarily preserve certain user account information (86% of which we complied with). Note: We carefully review each request for compliance with applicable laws and regulations. If we determine that a request is not legally valid, Reddit will challenge or reject it. (You can read more in our  and .)## While I have your attention...Id like to share an update about our thinking around quarantined communities.When we , we created an appeals process for sanctioned communities. One of the goals was to force subscribers to reconsider their behavior and incentivize moderators to make changes. While the policy attempted to hold moderators more accountable for enforcing healthier rules and norms, it didnt address the role that each member plays in the health of their community.Today, were making an update to address this gap: Users who consistently upvote policy-breaking content within quarantined communities will receive automated warnings, followed by further consequences like a temporary or permanent suspension. We hope this will encourage healthier behavior across these communities.## If youve read this farIn addition to this report, we share news throughout the year from teams across Reddit, and if you like posts about what were doing, you can stay up to date and talk to our teams in r/RedditSecurity, r/ModNews, r/redditmobile, and r/changelog.As usual, Ill be sticking around to answer your questions in the comments. AMA.Update: I'm off for now. Thanks for questions, everyone. Reddits 2018 transparency report (and maybe other stuff) Hi all,Today weve posted our latest .The purpose of the report is to share information about the requests Reddit receives to disclose user data or remove content from the site. We value your privacy and believe you have a right to know how data is being managed by Reddit and how it is shared (and not shared) with governmental and non-governmental parties.Weve included a breakdown of requests from governmental entities worldwide and from private parties from within the United States. The most common types of requests are subpoenas, court orders, search warrants, and emergency requests. In 2018, Reddit received a total of 581 requests to produce user account information from both United States and foreign governmental entities, which represents a 151% increase from the year before. We scrutinize all requests and object when appropriate, and we didnt disclose any information for 23% of the requests. We received 28 requests from foreign government authorities for the production of user account information and did not comply with any of those requests.This year, we expanded the report to included details on two additional types of content removals: those taken by us at Reddit, Inc., and those taken by subreddit moderators (including Automod actions). We remove content that is in violation of our site-wide policies, but subreddits often have additional rules specific to the . You can now see the breakdown of these two types of takedowns for a more holistic view of company and community actions.In other news, you may have heard that we closed an additional round of funding this week, which gives us more runway and will help us continue to improve our platform. What else does this mean for you? Not much. Our strategy and governance model remain the same. Andof coursewe do not share specific user data with any investor, new or old.Ill hang around for a while to answer your questions.Steve&#x200B;edit: Thanks for the silver you cheap bastards.update: I'm out for now. Will check back later."
}